toniebox-reverse-engineering/teddycloud/cyclone/cyclone_tcp/drivers/mac/s32k1_eth_driver.c
   //Configure ENET receive interrupt priority
   NVIC_SetPriority(ENET_RX_IRQn, NVIC_EncodePriority(S32K1_ETH_IRQ_PRIORITY_GROUPING,
      S32K1_ETH_IRQ_GROUP_PRIORITY, S32K1_ETH_IRQ_SUB_PRIORITY));

   //Configure ENET error interrupt priority
   NVIC_SetPriority(ENET_ERR_IRQn, NVIC_EncodePriority(S32K1_ETH_IRQ_PRIORITY_GROUPING,
      S32K1_ETH_IRQ_GROUP_PRIORITY, S32K1_ETH_IRQ_SUB_PRIORITY));

   //Enable Ethernet MAC
   ENET->ECR |= ENET_ECR_ETHEREN_MASK;
   //Instruct the DMA to poll the receive descriptor list
   ENET->RDAR = ENET_RDAR_RDAR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void s32k1EthInitGpio(NetInterface *interface)
{
//S32K1-EVB-Q176 evaluation board?
#if defined(USE_S32K148_EVB_Q176)
   //Enable PARTA, PORTB, PORTC and PORTD peripheral clocks
   PCC->PCCn[PCC_PORTA_INDEX] = PCC_PCCn_CGC_MASK;
   PCC->PCCn[PCC_PORTB_INDEX] = PCC_PCCn_CGC_MASK;
   PCC->PCCn[PCC_PORTC_INDEX] = PCC_PCCn_CGC_MASK;
   PCC->PCCn[PCC_PORTD_INDEX] = PCC_PCCn_CGC_MASK;

   //Configure RMII_RXD1 (PTC0)
   PORTC->PCR[0] = PORT_PCR_MUX(4);
   //Configure RMII_RXD0 (PTC1)
   PORTC->PCR[1] = PORT_PCR_MUX(5);
   //Configure RMII_TXD0 (PTC2)
   PORTC->PCR[2] = PORT_PCR_MUX(5);
   //Configure RMII_RXER (PTC16)
   //PORTC->PCR[16] = PORT_PCR_MUX(5) | PORT_PCR_PE_MASK;
   //Configure RMII_CRS_DV (PTC17)
   PORTC->PCR[17] = PORT_PCR_MUX(5);
   //Configure RMII_TXD1 (PTD7)
   PORTD->PCR[7] = PORT_PCR_MUX(5);
   //Configure RMII_REF_CLK (PTD11)
   PORTD->PCR[11] = PORT_PCR_MUX(5);
   //Configure RMII_TXEN (PTD12)
   PORTD->PCR[12] = PORT_PCR_MUX(5);

   //Configure RMII_MDIO (PTB4)
   PORTB->PCR[4] = PORT_PCR_MUX(5) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
   //Configure RMII_MDC (PTB5)
   PORTB->PCR[5] = PORT_PCR_MUX(7);

   //Configure ENET_RESET (PTA17) as an output
   PORTA->PCR[17] = PORT_PCR_MUX(1);
   PTA->PDDR |= (1 << 17);

   //Reset PHY transceiver
   PTA->PCOR |= (1 << 17);
   sleep(10);
   PTA->PSOR |= (1 << 17);
   sleep(10);
#endif
}


/**
 * @brief Initialize buffer descriptors
 * @param[in] interface Underlying network interface
 **/

void s32k1EthInitBufferDesc(NetInterface *interface)
{
   uint_t i;
   uint32_t address;

   //Clear TX and RX buffer descriptors
   osMemset(txBufferDesc, 0, sizeof(txBufferDesc));
   osMemset(rxBufferDesc, 0, sizeof(rxBufferDesc));

   //Initialize TX buffer descriptors
   for(i = 0; i < S32K1_ETH_TX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current TX buffer
      address = (uint32_t) txBuffer[i];
      //Transmit buffer address
      txBufferDesc[i][1] = address;
      //Generate interrupts
      txBufferDesc[i][2] = ENET_TBD2_INT;
   }

   //Mark the last descriptor entry with the wrap flag
   txBufferDesc[i - 1][0] |= ENET_TBD0_W;
   //Initialize TX buffer index
   txBufferIndex = 0;

   //Initialize RX buffer descriptors
   for(i = 0; i < S32K1_ETH_RX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current RX buffer
      address = (uint32_t) rxBuffer[i];
      //The descriptor is initially owned by the DMA
      rxBufferDesc[i][0] = ENET_RBD0_E;
      //Receive buffer address
      rxBufferDesc[i][1] = address;
      //Generate interrupts
      rxBufferDesc[i][2] = ENET_RBD2_INT;
   }

   //Mark the last descriptor entry with the wrap flag
   rxBufferDesc[i - 1][0] |= ENET_RBD0_W;
   //Initialize RX buffer index
   rxBufferIndex = 0;

   //Start location of the TX descriptor list
   ENET->TDSR = (uint32_t) txBufferDesc;
   //Start location of the RX descriptor list
   ENET->RDSR = (uint32_t) rxBufferDesc;
   //Maximum receive buffer size
   ENET->MRBR = S32K1_ETH_RX_BUFFER_SIZE;
}


/**
 * @brief S32K1 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void s32k1EthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void s32k1EthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(ENET_TX_IRQn);
   NVIC_EnableIRQ(ENET_RX_IRQn);
   NVIC_EnableIRQ(ENET_ERR_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void s32k1EthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(ENET_TX_IRQn);
   NVIC_DisableIRQ(ENET_RX_IRQn);
   NVIC_DisableIRQ(ENET_ERR_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Ethernet MAC transmit interrupt
 **/

void ENET_TX_IRQHandler(void)
{
   bool_t flag;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Packet transmitted?
   if((ENET->EIR & ENET_EIR_TXF_MASK) != 0)
   {
      //Clear TXF interrupt flag
      ENET->EIR = ENET_EIR_TXF_MASK;

